# read design 
read_verilog CoreUnit.v

# elaborate design hierarchy
hierarchy -check -top CoreUnit

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt; 

dfflegalize -cell $_DFF_P_ 01

# mapping logic to gates.
abc -g gates,MUX

# cleanup
clean -purge

# write synthesized design
write_json circuit.json

# Print statistics
stat